src/cf/Documents/уатНачислениеУдержаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатНачислениеУдержаний</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.уатУдержания</xr:Item>
				<xr:Item>AccumulationRegister.уатДоходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма удержаний в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МотивУдержания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУдержания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Удержания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТарифыЗП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удержание</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.уатУдержания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатШтраф</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатНачислениеУдержаний/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатНачислениеУдержаний";
	КомандаПечати.Идентификатор  = "ПриказОбУдержании";
	КомандаПечати.Представление  = НСтр("en='Deduction order';ru='Приказ об удержании'");
	КомандаПечати.Порядок        = 1;
		
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриказОбУдержании") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПриказОбУдержании", "Приказ об удержании",
			уатПечать_ПриказОбУдержании(МассивОбъектов, ОбъектыПечати));
	Иначе
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
	уатУправлениеПечатью.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры // Печать

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	СформироватьТаблицаОсновныеНачисления(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходы(ДокументСсылка, СтруктураДополнительныеСвойства);
КонецПроцедуры

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заглушка = Истина;
	
КонецПроцедуры

// Формирует печатную форму ПриказОбУдержании
//
// Параметры:
//  ИмяМакета - табличный документ
Функция уатПечать_ПриказОбУдержании(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеУдержаний";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатНачислениеУдержаний.ПФ_MXL_ПриказОбУдержании");
	
	мВалютаУпрУчета = Константы.ВалютаУправленческогоУчета.Получить();
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Приказ");
		
		СписокТребуемыхПараметров = "НаименованиеДляПечатныхФорм, ОКПО";
		СведенияОбОрганизации     = уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(ТекущийДокумент.Организация);
		ОбластьМакета.Параметры.РаботаОрганизацияНаименованиеСокращенное =
			уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(СведенияОбОрганизации, СписокТребуемыхПараметров);
		ОбластьМакета.Параметры.РаботаОрганизацияКодПоОКПО = СведенияОбОрганизации.КодПоОКПО;
		
		ПечатьПрефиксовВключена = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ТекущийДокумент.Организация,
			ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ВыводитьПрефиксПриПечати"));
		Если ПечатьПрефиксовВключена Тогда
			ОбластьМакета.Параметры.СсылкаНаОбъектНомерНаПечать = ТекущийДокумент.Номер;
		Иначе
			ОбластьМакета.Параметры.СсылкаНаОбъектНомерНаПечать = уатОбщегоНазначенияКлиентСервер.НомерДокументаНаПечать(
				ТекущийДокумент.Номер, Истина, Истина);
		КонецЕсли;
		
		ОбластьМакета.Параметры.СсылкаНаОбъектДатаНаПечать = ТекущийДокумент.Дата;
		
		РеквизитыВодителя = уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(
			ТекущийДокумент.Сотрудник, ТекущийДокумент.Дата, ТекущийДокумент.Организация);
		ДолжностьВодителя = СокрЛП(РеквизитыВодителя.Должность);
		
		Если ЗначениеЗаполнено(ТекущийДокумент.Сотрудник.ФизическоеЛицо) Тогда
			ФИОФизЛица = уатОбщегоНазначения.уатФИОФизЛица(ТекущийДокумент.Сотрудник.ФизическоеЛицо, ТекущийДокумент.Дата);
			
			Если ФИОФизЛица = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ФИОФизЛица.Фамилия) Тогда
				ФИОПолные = ТекущийДокумент.Сотрудник.Наименование;
			Иначе
				ФИОПолные = ФИОФизЛица.Фамилия + " " + ФИОФизЛица.Имя + " " + ФИОФизЛица.Отчество;
			КонецЕсли;
			Если ТекущийДокумент.Сотрудник.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				мПол = 1;
			ИначеЕсли ТекущийДокумент.Сотрудник.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				мПол = 2;
			Иначе
				мПол = Неопределено;
			КонецЕсли;

			ФИОВодителя = СклонениеПредставленийОбъектов.ПросклонятьФИО(СокрЛП(ФИОПолные), 2,, мПол);
		Иначе
			ФИОВодителя = СклонениеПредставленийОбъектов.ПросклонятьФИО(СокрЛП(ТекущийДокумент.Сотрудник.Наименование), 2,, Неопределено);
		КонецЕсли;
		ОбластьМакета.Параметры.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже = ФИОВодителя;
		ОбластьМакета.Параметры.РаботаДолжность = ДолжностьВодителя;
		ОбластьМакета.Параметры.РаботаСотрудникТабельныйНомерНаПечать = ТекущийДокумент.Сотрудник.Код;
		ОбластьМакета.Параметры.РаботаПодразделениеНаПечать = ТекущийДокумент.Подразделение;
		ОбластьМакета.Параметры.СсылкаНаОбъектМотивУдержания = ТекущийДокумент.МотивУдержания;
		ОбластьМакета.Параметры.СсылкаНаОбъектВидУдержанияНаПечать = ТекущийДокумент.ВидУдержания;
		ОбластьМакета.Параметры.ДанныеУдержанияСуммаУдержанияПрописью =
			уатОбщегоНазначенияТиповые.уатСформироватьСуммуПрописью(ТекущийДокумент.СуммаДокумента, мВалютаУпрУчета);
		ОбластьМакета.Параметры.ДанныеУдержанияРезультатНаПечать = уатОбщегоНазначенияТиповые.уатФорматСумм(
			ТекущийДокумент.СуммаДокумента, мВалютаУпрУчета);
		
		Руководители = уатОбщегоНазначенияТиповые.уатОтветственныеЛицаОрганизаций(
			ТекущийДокумент.Организация, ТекущийДокумент.Дата);
		ОбластьМакета.Параметры.СсылкаНаОбъектДолжностьРуководителя          = Руководители.РуководительДолжность;
		ОбластьМакета.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи =
			уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Руководители.Руководитель);
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура СформироватьТаблицаОсновныеНачисления(ДокументСсылка, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатУдержаниеУдержания.Ссылка КАК Ссылка,
	|	уатУдержаниеУдержания.Ссылка.ПериодНачисления КАК ПериодРегистрации,
	|	уатУдержаниеУдержания.Ссылка.ПериодНачисления КАК БазовыйПериодНачало,
	|	уатУдержаниеУдержания.Ссылка.ПериодНачисления КАК БазовыйПериодКонец,
	|	уатУдержаниеУдержания.Ссылка.Организация КАК Организация,
	|	уатУдержаниеУдержания.Ссылка.Подразделение КАК Подразделение,
	|	уатУдержаниеУдержания.Ссылка.Сотрудник КАК Сотрудник,
	|	уатУдержаниеУдержания.Удержание КАК ВидРасчета,
	|	СУММА(уатУдержаниеУдержания.Сумма) КАК Результат,
	|	уатУдержаниеУдержания.Тариф КАК Тариф,
	|	уатУдержаниеУдержания.ТС КАК ТС
	|ИЗ
	|	Документ.уатНачислениеУдержаний.Удержания КАК уатУдержаниеУдержания
	|ГДЕ
	|	уатУдержаниеУдержания.Ссылка = &Док
	|
	|СГРУППИРОВАТЬ ПО
	|	уатУдержаниеУдержания.Ссылка,
	|	уатУдержаниеУдержания.Удержание,
	|	уатУдержаниеУдержания.Ссылка.ПериодНачисления,
	|	уатУдержаниеУдержания.Ссылка.Организация,
	|	уатУдержаниеУдержания.Ссылка.Подразделение,
	|	уатУдержаниеУдержания.Ссылка.Сотрудник,
	|	уатУдержаниеУдержания.Тариф,
	|	уатУдержаниеУдержания.Ссылка.ПериодНачисления,
	|	уатУдержаниеУдержания.Ссылка.ПериодНачисления,
	|	уатУдержаниеУдержания.ТС");
	Запрос.УстановитьПараметр("Док", ДокументСсылка);
	мТаблица = Запрос.Выполнить().Выгрузить();
	
	флНачислятьПоПодразделениюСотрудника = НЕ уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.НачислятьЗарплатуПоПодразделениюДокумента);
	Если флНачислятьПоПодразделениюСотрудника Тогда
		РеквизитыВодителя = уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(
			ДокументСсылка.Сотрудник, ДокументСсылка.ПериодНачисления, ДокументСсылка.Организация);
		Для Каждого ТекСтрока Из мТаблица Цикл
			ТекСтрока.Подразделение = РеквизитыВодителя.ПодразделениеОрганизации;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУдержаний", мТаблица);
КонецПроцедуры

Процедура СформироватьТаблицаДоходы(ДокументСсылка, СтруктураДополнительныеСвойства)
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьУчетДоходовИРасходов") = ЛОЖЬ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатУдержаниеУдержания.Ссылка КАК Регистратор,
	|	уатУдержаниеУдержания.Ссылка.ПериодНачисления КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	уатУдержаниеУдержания.Удержание.СтатьяДоходов КАК СтатьяДоходов,
	|	уатУдержаниеУдержания.Ссылка.Организация КАК Организация,
	|	уатУдержаниеУдержания.Ссылка.Подразделение КАК Подразделение,
	|	уатУдержаниеУдержания.Ссылка.Сотрудник КАК Сотрудник,
	|	уатУдержаниеУдержания.ТС КАК ТС,
	|	уатУдержаниеУдержания.Сумма КАК СуммаУпр,
	|	0 КАК СуммаРегл
	|ИЗ
	|	Документ.уатНачислениеУдержаний.Удержания КАК уатУдержаниеУдержания
	|ГДЕ
	|	уатУдержаниеУдержания.Ссылка = &Док");
	Запрос.УстановитьПараметр("Док", ДокументСсылка);
	
	ТаблицаДоходы = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из ТаблицаДоходы Цикл
		ТекСтрока.СуммаРегл = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаУпр,
			СтруктураДополнительныеСвойства.ВалютаУпрУчета, СтруктураДополнительныеСвойства.ВалютаРеглУчета,
			СтруктураДополнительныеСвойства.КурсУпр,        СтруктураДополнительныеСвойства.КурсРегл,
			СтруктураДополнительныеСвойства.КратностьУпр,   СтруктураДополнительныеСвойства.КратностьРегл,,
			ДокументСсылка);
	КонецЦикла;
		
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходы", ТаблицаДоходы);
КонецПроцедуры

#КонецОбласти


#КонецЕсли
